// ?ДОМАШНЕЄ ЗАВДАННЯ: МІНІМУМ

alert('Тут вже показується все із зовнішнього js-файла')

// Правильні імена змінних
let name = 'Andrew'
let surName = 'Borisenko'
let $name = 'Polina'
let _surname = 'Zelenskii'
let прізвище = 'Солодкий' // допускається кирилиця та будья-яка інша мова, але прийнято писати англійською мовою

alert(
  'Правильні імена змінних: name, surName, $name, _surname, також допускається будь-яка мова для написання змінної, але рекомендовано використовувати англійську'
)

// Неправильні імена змінних
/*
let some name = Andrew;
let 7name = Olya;
const my-surname = "Bardash";
let let = "Orest";
let class = "Anton";
let return = ["1", "2"];
let function = 7; 
*/

// Неправильні імена змінних: 7s; my-name; а також зарезервовані слова - let, class, return, function та інші слова (всього близько 180 зарезервованих слів)
alert(
  'Неправильні імена змінних: 7s; my-name; а також зарезервовані слова - let, class, return, function та інші слова (всього близько 180 зарезервованих слів)'
)

// 2 способи коментування коду: один рядок коду - через подвійний слеш // ; багато рядків коду - через /*якийсь код*/ ;
alert(
  '2 способи коментування коду: один рядок коду - через подвійний слеш // ; багато рядків коду - через /*якийсь код*/'
)

// Правила написання імен змінних: верблюжий метод; у нижньому та верхньому регістрах; можна використовувати букви, цифри або символи "_" та "$"
alert(
  'Правила написання імен змінних: верблюжий метод; у нижньому та верхньому регістрах; можна використовувати букви, цифри або символи _ та $ '
)

// ?ДОМАШНЕЄ ЗАВДАННЯ: НОРМА
// Завдання 1
let names = prompt('Як тебе звати?', ' ')
alert(`Привіт, ${names}!`)

// Завдання 2
let age = +prompt(`${names}, якого ти року народження?`, ' ')
const currentAge = 2022
let oldAge = currentAge - age
alert(`Ого! Тобі ${oldAge}? Нічого собі\)`)

// Завдання 3
let length = +prompt(
  `${names} вкажи, будь-ласка, сторону квадрата для розрахунку периметру в см - вказуй цифру`,
  ''
)
let per = length * 4
alert(`Дякую, ${names}. Периметр квадрату складає: ${per} см`)

// ?ДОМАШНЕЄ ЗАВДАННЯ: МАКСИМУМ
// Завдання 1
let radius = +prompt('А який радіус кола назвеш в см, теж цифрою?', '')
let lengthCircle = 2 * Math.PI * radius
alert(
  `Ну що ж ${names}, довжина кола складає: ${lengthCircle} см. Тепер твоя 5-ка в кишені!`
)

// Завдання 2
let way = +prompt(
  `${names} продовжимо вікторину. Уявімо, що ти хочеш дістатися з Києва до Львова. Як гадаєш, скільки кілометрів займе твій шлях?`,
  ''
)
let time = +prompt('А за скільки годин ти хотів би доїхати?', '')
let result = way / time
alert(
  `${names} тобі потрібно їхати зі швидкістю ${result} км/год, щоб за ${time} годин подолати відстань в ${way} км з Києва до Львова`
)

// Завдання 3
let sumUsd = +prompt(
  `${names} введи, будь-ласка, суму доларів, яку ти хочеш перевести в євро`,
  ''
)
const usd = 36.56 // актуальний курс євро до гривні на 5 жовтня 2022 року
const euro = 35.7 // актуальний курс євро до гривні на 5 жовтня 2022 року
let euroToUsd = usd / euro
let sumEuro = sumUsd * euroToUsd
alert(`${names} за ${sumUsd} доларів ти отримаєш ${sumEuro} євро`)
